**free

dcl-s SPFIN               packed(5:0);
dcl-s SPINFIELD           packed(5:0);
dcl-s SPINSEPERATOR         char(1);
dcl-s SPINSTRING            char(32000);
dcl-s SPLENG              packed(5:0);
dcl-s SPNOTFOUND          packed(1:0);
dcl-s SPOUTBACK             char(32000);
dcl-s SPSEPCNT            packed(5:0);
dcl-s SPSTART             packed(5:0);
