     A********************************************************************
     A*
     A*
     A*
     A*   JH7cfg10l2 - Field Table
     A************1234567890******A*********1*****************************
     A*
     A          R HL7CFG10R                 PFILE(JH7CFG10)
     A          K CFGID
     A          K CFG10SEGNM
     A          K CFG10GROUP
     A          K CFG10KR
     A          S CFG10AD                   VALUES('A' 'a')
