     A********************************************************************
     A*
     A*
     A*
     A*   JH7doc30 - Field Descriptions
     A************1234567890******A*********1*****************************
     A*
     A          R HL7DOC30R                 PFILE(JH7DOC30)
     A
     A          K D3HFID
     A          K D3VARTYPE
     A          K D3TYPE
     A
     A
