     A********************************************************************
     A*
     A*
     A*
     A*   JH7env20l1 - 
     A************1234567890******A*********1*****************************
     A*
     A                                      UNIQUE
     A          R HL7ENV2R                  PFILE(JH7ENV20)
     A          K ENID
     A
     A          S ENVACTDEA                 VALUES('A' 'a')
     A*
