     A********************************************************************
     A*
     A*
     A*
     A*   JH7tmpkl1 - Temp File - Holds Keys - not realy needed anymore
     A************1234567890******A*********1*****************************
     A*
     A          R HL7TMPKR                  PFILE(JH7TMPK)
     A          K TMPOBJECT
     A          K TMPGRP
     A          K TMPKEYT
