     A********************************************************************
     A*
     A*
     A*
     A*   JH7tmpkl2 - Temp File - Holds Keys - Not realy needed
     A************1234567890******A*********1*****************************
      *
     A          R HL7TMPKR                  PFILE(JH7TMPK)
     A          K TMPKEY
