     A********************************************************************
     A*
     A* jh7xml30 - XML File locations
     A*
     A************1234567890******A*********1*****************************
     A*
     A          R HL7XML10R                 PFILE(JH7XML10)
     A          K XML10ID
     A          S XML10AD                   VALUES('A' 'a')
